Revit 2027 API
SiteSubRegion.GetBoundary Method
 Gets the boundary of current subregion.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetBoundary()
Public Function GetBoundary As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetBoundary()
member GetBoundary : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The curve loops that represent the boundary.
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace